# First notebook

In [55]:
import pandas as pd

dfEindtoets = pd.read_excel('Data/eindtoets.xlsx')
dfFivePoints = pd.read_csv('Data/restructured_fivepointstest.csv')

In [56]:
# Drop column Unnamed
dfFivePoints = dfFivePoints.drop('Unnamed: 0', axis=1)

dfFivePoints.head()

,student_id,patternsm,statuscl,numbercl,timestampcl,timestampload,timestampsm,primary_keys
0,1,"0,0,1,0,0,0,1,0","1,1","3,7","1583742751461,1583742751869",1.583743e+12,2520.0,"[36, 37, 38, 39, 40, 41]"
1,1,"1,1,0,0,0,0,0,0","1,1","2,1","1583742753766,1583742754238",1.583743e+12,2576.0,"[47, 48, 49, 50, 51, 52]"
2,1,"0,0,1,1,0,0,0,0","1,1","3,4","1583742756412,1583742756876",1.583743e+12,2541.0,"[53, 54, 55, 56, 57, 58]"
3,1,"0,0,0,0,0,1,0,1","1,1","8,6","1583742759029,1583742759476",1.583743e+12,2540.0,"[59, 60, 61, 62, 63, 64]"
4,1,"0,0,1,1,0,0,0,0","1,1","4,3","1583742761381,1583742762222",1.583743e+12,2384.0,"[65, 66, 67, 68, 69, 70]"

In [57]:
# Amount unique student id
print('Amount of unique student id in eindtoets:', len(dfFivePoints['student_id'].unique()))

Amount of unique student id in eindtoets: 4550

In [58]:
# Cleaning data
dfEindtoets['cito'] = dfEindtoets['cito'].replace('', pd.NA).astype('Int64')
dfEindtoets['schooljaar'] = dfEindtoets['schooljaar'].replace('', pd.NA)
dfEindtoets['gender'] = dfEindtoets['gender'].replace('', pd.NA).astype('Int64')

# Filtering rows
filtered_df = dfEindtoets.dropna(subset=['cito', 'school', 'gender'])

# Output
print(filtered_df[['idll_vo3lv', 'cito','school', 'gender']])

      idll_vo3lv  cito   school  gender
1              3   518  vmbo kl       1
4              6   524  vmbo bl       0
6              8   529  vmbo bl       1
9             11   533  vmbo kl       0
11            13   534  vmbo kl       0
...          ...   ...      ...     ...
4227        9638   549      vwo       1
4228        9640   543      vwo       0
4231        9649   543      vwo       1
4232        9656   543      vwo       0
4234        9663   545      vwo       0

[2214 rows x 4 columns]

In [72]:
filtered_df.head()

# Use idll_vo3lv cito and school
studentdf = filtered_df[['idll_vo3lv', 'cito', 'school']]

# Rename idll_vo3lv to student_id
studentdf = studentdf.rename(columns={'idll_vo3lv': 'student_id'})

studentdf.head()

    student_id  cito   school
1            3   518  vmbo kl
4            6   524  vmbo bl
6            8   529  vmbo bl
9           11   533  vmbo kl
11          13   534  vmbo kl